garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1768.PIC
        <edc:SFRDef edc:access="------nn" edc:cname="CM3CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM3CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x119">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C3INTN" edc:desc="" edc:mask="0x1" edc:name="C3INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3INTP" edc:desc="" edc:mask="0x1" edc:name="C3INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM3NSEL" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM3NSEL" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0x7" edc:name="NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NCH0" edc:desc="" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:desc="" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:desc="" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C3NCH" edc:desc="" edc:mask="0x7" edc:name="C3NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C3NCH0" edc:desc="" edc:mask="0x1" edc:name="C3NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3NCH1" edc:desc="" edc:mask="0x1" edc:name="C3NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3NCH2" edc:desc="" edc:mask="0x1" edc:name="C3NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM3PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM3PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C3PCH" edc:desc="" edc:mask="0xf" edc:name="C3PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C3PCH0" edc:desc="" edc:mask="0x1" edc:name="C3PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH1" edc:desc="" edc:mask="0x1" edc:name="C3PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH2" edc:desc="" edc:mask="0x1" edc:name="C3PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH3" edc:desc="" edc:mask="0x1" edc:name="C3PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-nnrnn" edc:cname="CM4CON0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00100" edc:name="CM4CON0" edc:nzwidth="8" edc:por="00-00100" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Reserved" edc:desc="" edc:mask="0x1" edc:name="Reserved" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZLF" edc:desc="" edc:mask="0x1" edc:name="ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C4SYNC" edc:desc="" edc:mask="0x1" edc:name="C4SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4HYS" edc:desc="" edc:mask="0x1" edc:name="C4HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4SP" edc:desc="" edc:mask="0x1" edc:name="C4SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4ZLF" edc:desc="" edc:mask="0x1" edc:name="C4ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4POL" edc:desc="" edc:mask="0x1" edc:name="C4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C4OUT" edc:desc="" edc:mask="0x1" edc:name="C4OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4ON" edc:desc="" edc:mask="0x1" edc:name="C4ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM4CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM4CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C4INTN" edc:desc="" edc:mask="0x1" edc:name="C4INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4INTP" edc:desc="" edc:mask="0x1" edc:name="C4INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM4NSEL" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM4NSEL" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0x7" edc:name="NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NCH0" edc:desc="" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:desc="" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:desc="" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C4NCH" edc:desc="" edc:mask="0x7" edc:name="C4NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C4NCH0" edc:desc="" edc:mask="0x1" edc:name="C4NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4NCH1" edc:desc="" edc:mask="0x1" edc:name="C4NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4NCH2" edc:desc="" edc:mask="0x1" edc:name="C4NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM4PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM4PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C4PCH" edc:desc="" edc:mask="0xf" edc:name="C4PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C4PCH0" edc:desc="" edc:mask="0x1" edc:name="C4PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4PCH1" edc:desc="" edc:mask="0x1" edc:name="C4PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4PCH2" edc:desc="" edc:mask="0x1" edc:name="C4PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4PCH3" edc:desc="" edc:mask="0x1" edc:name="C4PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x180"/>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="ANSELA" edc:desc="" edc:impl="0x17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---1-111" edc:name="ANSELA" edc:nzwidth="0x8" edc:por="---1-111" edc:_addr="0x18C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
