garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1768.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="MD2CARL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="MD2CARL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02566_txm_mod_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x31E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CL" edc:desc="" edc:mask="0xf" edc:name="CL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CL0" edc:desc="" edc:mask="0x1" edc:name="CL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL1" edc:desc="" edc:mask="0x1" edc:name="CL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL2" edc:desc="" edc:mask="0x1" edc:name="CL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL3" edc:desc="" edc:mask="0x1" edc:name="CL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD2CL" edc:desc="" edc:mask="0xf" edc:name="MD2CL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD2CL0" edc:desc="" edc:mask="0x1" edc:name="MD2CL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CL1" edc:desc="" edc:mask="0x1" edc:name="MD2CL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CL2" edc:desc="" edc:mask="0x1" edc:name="MD2CL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CL3" edc:desc="" edc:mask="0x1" edc:name="MD2CL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="MD2CARH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="MD2CARH" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02566_txm_mod_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x31F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CH" edc:desc="" edc:mask="0xf" edc:name="CH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CH0" edc:desc="" edc:mask="0x1" edc:name="CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH1" edc:desc="" edc:mask="0x1" edc:name="CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH2" edc:desc="" edc:mask="0x1" edc:name="CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH3" edc:desc="" edc:mask="0x1" edc:name="CH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD2CH" edc:desc="" edc:mask="0xf" edc:name="MD2CH" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD2CH0" edc:desc="" edc:mask="0x1" edc:name="MD2CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CH1" edc:desc="" edc:mask="0x1" edc:name="MD2CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CH2" edc:desc="" edc:mask="0x1" edc:name="MD2CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CH3" edc:desc="" edc:mask="0x1" edc:name="MD2CH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="7" edc:beginaddr="0x380" edc:endaddr="0x3A0" edc:regionid="sfr7">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x380"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INLVLA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="INLVLA" edc:nzwidth="8" edc:por="--111111" edc:_addr="0x38C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLA0" edc:desc="" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA1" edc:desc="" edc:mask="0x1" edc:name="INLVLA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA2" edc:desc="" edc:mask="0x1" edc:name="INLVLA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA3" edc:desc="" edc:mask="0x1" edc:name="INLVLA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA4" edc:desc="" edc:mask="0x1" edc:name="INLVLA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA5" edc:desc="" edc:mask="0x1" edc:name="INLVLA5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="INLVLB" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111----" edc:name="INLVLB" edc:nzwidth="8" edc:por="1111----" edc:_addr="0x38D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="INLVLB4" edc:desc="" edc:mask="0x1" edc:name="INLVLB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB5" edc:desc="" edc:mask="0x1" edc:name="INLVLB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB6" edc:desc="" edc:mask="0x1" edc:name="INLVLB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB7" edc:desc="" edc:mask="0x1" edc:name="INLVLB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLC" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x38E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLC0" edc:desc="" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC1" edc:desc="" edc:mask="0x1" edc:name="INLVLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC2" edc:desc="" edc:mask="0x1" edc:name="INLVLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC3" edc:desc="" edc:mask="0x1" edc:name="INLVLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC4" edc:desc="" edc:mask="0x1" edc:name="INLVLC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC5" edc:desc="" edc:mask="0x1" edc:name="INLVLC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC6" edc:desc="" edc:mask="0x1" edc:name="INLVLC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC7" edc:desc="" edc:mask="0x1" edc:name="INLVLC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x38F"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAP" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAP" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x391">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAP0" edc:desc="" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP1" edc:desc="" edc:mask="0x1" edc:name="IOCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP2" edc:desc="" edc:mask="0x1" edc:name="IOCAP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP3" edc:desc="" edc:mask="0x1" edc:name="IOCAP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP4" edc:desc="" edc:mask="0x1" edc:name="IOCAP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP5" edc:desc="" edc:mask="0x1" edc:name="IOCAP5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAN" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x392">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:desc="" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:desc="" edc:mask="0x1" edc:name="IOCAN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:desc="" edc:mask="0x1" edc:name="IOCAN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:desc="" edc:mask="0x1" edc:name="IOCAN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:desc="" edc:mask="0x1" edc:name="IOCAN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:desc="" edc:mask="0x1" edc:name="IOCAN5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
