garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1768.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC2REFH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC2REFH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x596">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="DAC2CON2"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="REF" edc:desc="" edc:mask="0xff" edc:name="REF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC2REF8" edc:desc="" edc:mask="0x1" edc:name="DAC2REF8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF9" edc:desc="" edc:mask="0x1" edc:name="DAC2REF9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF10" edc:desc="" edc:mask="0x1" edc:name="DAC2REF10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF11" edc:desc="" edc:mask="0x1" edc:name="DAC2REF11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF12" edc:desc="" edc:mask="0x1" edc:name="DAC2REF12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF13" edc:desc="" edc:mask="0x1" edc:name="DAC2REF13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF14" edc:desc="" edc:mask="0x1" edc:name="DAC2REF14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF15" edc:desc="" edc:mask="0x1" edc:name="DAC2REF15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="R8" edc:desc="" edc:mask="0x1" edc:name="R8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R9" edc:desc="" edc:mask="0x1" edc:name="R9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R10" edc:desc="" edc:mask="0x1" edc:name="R10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R11" edc:desc="" edc:mask="0x1" edc:name="R11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R12" edc:desc="" edc:mask="0x1" edc:name="R12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R13" edc:desc="" edc:mask="0x1" edc:name="R13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R14" edc:desc="" edc:mask="0x1" edc:name="R14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R15" edc:desc="" edc:mask="0x1" edc:name="R15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="DAC2R8" edc:desc="" edc:mask="0x1" edc:name="DAC2R8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R9" edc:desc="" edc:mask="0x1" edc:name="DAC2R9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R10" edc:desc="" edc:mask="0x1" edc:name="DAC2R10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R11" edc:desc="" edc:mask="0x1" edc:name="DAC2R11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R12" edc:desc="" edc:mask="0x1" edc:name="DAC2R12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R13" edc:desc="" edc:mask="0x1" edc:name="DAC2R13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R14" edc:desc="" edc:mask="0x1" edc:name="DAC2R14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R15" edc:desc="" edc:mask="0x1" edc:name="DAC2R15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.3">
                <edc:SFRFieldDef edc:cname="REF8" edc:desc="" edc:mask="0x1" edc:name="REF8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF9" edc:desc="" edc:mask="0x1" edc:name="REF9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF10" edc:desc="" edc:mask="0x1" edc:name="REF10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF11" edc:desc="" edc:mask="0x1" edc:name="REF11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF12" edc:desc="" edc:mask="0x1" edc:name="REF12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF13" edc:desc="" edc:mask="0x1" edc:name="REF13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF14" edc:desc="" edc:mask="0x1" edc:name="REF14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF15" edc:desc="" edc:mask="0x1" edc:name="REF15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-n-nn-n" edc:cname="DAC3CON0" edc:desc="" edc:impl="0xad" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-00-0" edc:name="DAC3CON0" edc:nzwidth="8" edc:por="0-0-00-0" edc:_modsrc="DOS-01073_5bit_DAC_wNSS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x597">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x1" edc:name="NSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:desc="" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:desc="" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x1" edc:name="DACNSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC3NSS" edc:desc="" edc:mask="0x1" edc:name="DAC3NSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC3PSS" edc:desc="" edc:mask="0x3" edc:name="DAC3PSS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC3OE1" edc:desc="" edc:mask="0x1" edc:name="DAC3OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC3EN" edc:desc="" edc:mask="0x1" edc:name="DAC3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DAC3PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC3PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC3PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC3PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
