garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1768.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG2FIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG2FIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x719">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIS0" edc:desc="" edc:mask="0x1" edc:name="FIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS1" edc:desc="" edc:mask="0x1" edc:name="FIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS2" edc:desc="" edc:mask="0x1" edc:name="FIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS3" edc:desc="" edc:mask="0x1" edc:name="FIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS4" edc:desc="" edc:mask="0x1" edc:name="FIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS5" edc:desc="" edc:mask="0x1" edc:name="FIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS6" edc:desc="" edc:mask="0x1" edc:name="FIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS7" edc:desc="" edc:mask="0x1" edc:name="FIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2FIS0" edc:desc="" edc:mask="0x1" edc:name="G2FIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS1" edc:desc="" edc:mask="0x1" edc:name="G2FIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS2" edc:desc="" edc:mask="0x1" edc:name="G2FIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS3" edc:desc="" edc:mask="0x1" edc:name="G2FIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS4" edc:desc="" edc:mask="0x1" edc:name="G2FIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS5" edc:desc="" edc:mask="0x1" edc:name="G2FIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS6" edc:desc="" edc:mask="0x1" edc:name="G2FIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS7" edc:desc="" edc:mask="0x1" edc:name="G2FIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG2FIS1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG2FIS1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x71A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIS8" edc:desc="" edc:mask="0x1" edc:name="FIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS9" edc:desc="" edc:mask="0x1" edc:name="FIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS10" edc:desc="" edc:mask="0x1" edc:name="FIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS11" edc:desc="" edc:mask="0x1" edc:name="FIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS12" edc:desc="" edc:mask="0x1" edc:name="FIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS13" edc:desc="" edc:mask="0x1" edc:name="FIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS14" edc:desc="" edc:mask="0x1" edc:name="FIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS15" edc:desc="" edc:mask="0x1" edc:name="FIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2FIS8" edc:desc="" edc:mask="0x1" edc:name="G2FIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS9" edc:desc="" edc:mask="0x1" edc:name="G2FIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS10" edc:desc="" edc:mask="0x1" edc:name="G2FIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS11" edc:desc="" edc:mask="0x1" edc:name="G2FIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS12" edc:desc="" edc:mask="0x1" edc:name="G2FIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS13" edc:desc="" edc:mask="0x1" edc:name="G2FIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS14" edc:desc="" edc:mask="0x1" edc:name="G2FIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FIS15" edc:desc="" edc:mask="0x1" edc:name="G2FIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG2FSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG2FSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x71B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSIM0" edc:desc="" edc:mask="0x1" edc:name="FSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM1" edc:desc="" edc:mask="0x1" edc:name="FSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM2" edc:desc="" edc:mask="0x1" edc:name="FSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM3" edc:desc="" edc:mask="0x1" edc:name="FSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM4" edc:desc="" edc:mask="0x1" edc:name="FSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM5" edc:desc="" edc:mask="0x1" edc:name="FSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM6" edc:desc="" edc:mask="0x1" edc:name="FSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM7" edc:desc="" edc:mask="0x1" edc:name="FSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2FSIM0" edc:desc="" edc:mask="0x1" edc:name="G2FSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FSIM1" edc:desc="" edc:mask="0x1" edc:name="G2FSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FSIM2" edc:desc="" edc:mask="0x1" edc:name="G2FSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FSIM3" edc:desc="" edc:mask="0x1" edc:name="G2FSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FSIM4" edc:desc="" edc:mask="0x1" edc:name="G2FSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FSIM5" edc:desc="" edc:mask="0x1" edc:name="G2FSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FSIM6" edc:desc="" edc:mask="0x1" edc:name="G2FSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2FSIM7" edc:desc="" edc:mask="0x1" edc:name="G2FSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
