garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1768.PIC
        <edc:JoinedSFRDef edc:cname="PWM6TMR" edc:desc="" edc:name="PWM6TMR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM6TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6TMRL0" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRL1" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRL2" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRL3" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRL4" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRL5" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRL6" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRL7" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6TMRL" edc:desc="" edc:mask="0xff" edc:name="PWM6TMRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM6TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6TMRH0" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRH1" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRH2" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRH3" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRH4" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRH5" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRH6" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6TMRH7" edc:desc="" edc:mask="0x1" edc:name="PWM6TMRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6TMRH" edc:desc="" edc:mask="0xff" edc:name="PWM6TMRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnn--" edc:cname="PWM6CON" edc:desc="" edc:impl="0xbc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000--" edc:name="PWM6CON" edc:nzwidth="8" edc:por="0-0000--" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM6MODE0" edc:desc="" edc:mask="0x1" edc:name="PWM6MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6MODE1" edc:desc="" edc:mask="0x1" edc:name="PWM6MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM6MODE" edc:desc="" edc:mask="0x3" edc:name="PWM6MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PWM6POL" edc:desc="" edc:mask="0x1" edc:name="PWM6POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6OUT" edc:desc="" edc:mask="0x1" edc:name="PWM6OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM6EN" edc:desc="" edc:mask="0x1" edc:name="PWM6EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM6INTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM6INTE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAC">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM6INTCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIE" edc:desc="" edc:mask="0x1" edc:name="PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIE" edc:desc="" edc:mask="0x1" edc:name="DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIE" edc:desc="" edc:mask="0x1" edc:name="PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIE" edc:desc="" edc:mask="0x1" edc:name="OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM6PRIE" edc:desc="" edc:mask="0x1" edc:name="PWM6PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6DCIE" edc:desc="" edc:mask="0x1" edc:name="PWM6DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PHIE" edc:desc="" edc:mask="0x1" edc:name="PWM6PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6OFIE" edc:desc="" edc:mask="0x1" edc:name="PWM6OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----cccc" edc:cname="PWM6INTF" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM6INTF" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAD">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM6INTFLG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIF" edc:desc="" edc:mask="0x1" edc:name="PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIF" edc:desc="" edc:mask="0x1" edc:name="DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIF" edc:desc="" edc:mask="0x1" edc:name="PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIF" edc:desc="" edc:mask="0x1" edc:name="OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM6PRIF" edc:desc="" edc:mask="0x1" edc:name="PWM6PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6DCIF" edc:desc="" edc:mask="0x1" edc:name="PWM6DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PHIF" edc:desc="" edc:mask="0x1" edc:name="PWM6PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6OFIF" edc:desc="" edc:mask="0x1" edc:name="PWM6OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
