garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1768.PIC
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM6CLKCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM6CLKCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x7" edc:name="PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM6CS0" edc:desc="" edc:mask="0x1" edc:name="PWM6CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6CS1" edc:desc="" edc:mask="0x1" edc:name="PWM6CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6CS2" edc:desc="" edc:mask="0x1" edc:name="PWM6CS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PS0" edc:desc="" edc:mask="0x1" edc:name="PWM6PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PS1" edc:desc="" edc:mask="0x1" edc:name="PWM6PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PS2" edc:desc="" edc:mask="0x1" edc:name="PWM6PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM6CS" edc:desc="" edc:mask="0x7" edc:name="PWM6CS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PS" edc:desc="" edc:mask="0x7" edc:name="PWM6PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:desc="" edc:mask="0x1" edc:name="CS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-----n" edc:cname="PWM6LDCON" edc:desc="" edc:impl="0xc1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----0" edc:name="PWM6LDCON" edc:nzwidth="8" edc:por="00-----0" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDS" edc:desc="" edc:mask="0x1" edc:name="LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LDT" edc:desc="" edc:mask="0x1" edc:name="LDT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDA" edc:desc="" edc:mask="0x1" edc:name="LDA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM6LDS0" edc:desc="" edc:mask="0x1" edc:name="PWM6LDS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM6LDS" edc:desc="" edc:mask="0x1" edc:name="PWM6LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM6LDM" edc:desc="" edc:mask="0x1" edc:name="PWM6LDM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6LD" edc:desc="" edc:mask="0x1" edc:name="PWM6LD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LDS0" edc:desc="" edc:mask="0x1" edc:name="LDS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn---n" edc:cname="PWM6OFCON" edc:desc="" edc:impl="0x71" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000---0" edc:name="PWM6OFCON" edc:nzwidth="8" edc:por="-000---0" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFS" edc:desc="" edc:mask="0x1" edc:name="OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OFO" edc:desc="" edc:mask="0x1" edc:name="OFO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM" edc:desc="" edc:mask="0x3" edc:name="OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM6OFS0" edc:desc="" edc:mask="0x1" edc:name="PWM6OFS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM6OFM0" edc:desc="" edc:mask="0x1" edc:name="PWM6OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6OFM1" edc:desc="" edc:mask="0x1" edc:name="PWM6OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM6OFS" edc:desc="" edc:mask="0x1" edc:name="PWM6OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM6OFMC" edc:desc="" edc:mask="0x1" edc:name="PWM6OFMC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6OFM" edc:desc="" edc:mask="0x3" edc:name="PWM6OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OFS0" edc:desc="" edc:mask="0x1" edc:name="OFS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OFM0" edc:desc="" edc:mask="0x1" edc:name="OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM1" edc:desc="" edc:mask="0x1" edc:name="OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe70" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE00"/>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0xE0C"/>
        <edc:SFRDef edc:access="-------n" edc:cname="PPSLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PPSLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0xE0F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPSLOCKED" edc:desc="" edc:mask="0x1" edc:name="PPSLOCKED" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="INTPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="INTPPS" edc:nzwidth="8" edc:por="---00010" edc:_addr="0xE10">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTPPS" edc:desc="" edc:mask="0x1f" edc:name="INTPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
